УТ_для_edt/src/Documents/смартОбучениеСотрудников/смартОбучениеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартОбучениеСотрудников</name>
  <comment>#4898 смарт: Тимофеева 17.11.2025 / Создание механизма для учета квалификаций инженеров и менеджеров.</comment>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбучения</name>
    <type>
      <types>EnumRef.смартВидыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>CatalogRef.CRM_Помещения</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.смартСостоянияДокументовОбученияСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.смартПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтражения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Квалификации</name>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.смартКвалификацииМенеджеров</types>
        <types>CatalogRef.смартУчебныеДисциплины</types>
        <types>CatalogRef.смартОборудованиеКлиентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Преподаватели</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БронируемоеОборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.демоОборудованиеДляДемонстрации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыОбучения</name>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.смартКвалификацииМенеджеров</types>
        <types>CatalogRef.смартУчебныеДисциплины</types>
        <types>CatalogRef.смартОборудованиеКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Зачет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗРР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПНР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредставителиКлиента</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/смартСостоянияДокументовОбученияСотрудников/смартСостоянияДокументовОбученияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСостоянияДокументовОбученияСотрудников</name>
  <comment>#4898 смарт: Тимофеева 17.11.2025 / Создание механизма для учета квалификаций инженеров и менеджеров. </comment>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Планирование</name>
  </enumValues>
  <enumValues>
    <name>ОборудованиеЗарезервировано</name>
  </enumValues>
  <enumValues>
    <name>ПроходящиеОбучениеУказаны</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеРезультатов</name>
  </enumValues>
  <enumValues>
    <name>РезультатыОтражены</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартВариантыОценкиОбучения/смартВариантыОценкиОбучения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВариантыОценкиОбучения</name>
  <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров. </comment>
  <enumValues>
    <name>ЗачетНезачет</name>
  </enumValues>
  <enumValues>
    <name>ДесятибалльнаяШкала</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/МаркетинговыеМероприятияДокумент/МаркетинговыеМероприятияДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркетинговыеМероприятияДокумент</name>
  <registerRecords>AccumulationRegister.демоДемонстрацияОборудования</registerRecords>
  <attributes>
    <name>НаименованиеМероприятия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМероприятия</name>
    <type>
      <types>CatalogRef.демоТипыМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлиентПартнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительДемоЗал</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПроведенияОт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПроведенияДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оценка1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка4</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка5</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсроченнаяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПоставилОценку</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДемоЗал</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.смартОбучениеСотрудников</types>
      <types>DocumentRef.МаркетинговыеМероприятияДокумент</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>КомуПередано</name>
    <comment>// #026 181 01.03.2020</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИнженера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаИзготовления</name>
    <comment>// #061 310 06.08.2020</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочно</name>
    <comment>// #061 310 06.08.2020</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРабот</name>
    <comment>// #061 310 06.08.2020</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДатаНачала</name>
    <comment>//++ #Б-1474 смарт: Фролов 03.12.2024 //Доработка функционала Маркетингового мероприятия</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДатаОкончания</name>
    <comment>//++ #Б-1474 смарт: Фролов 03.12.2024 //Доработка функционала Маркетингового мероприятия</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>#Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.</comment>
    <type>
      <types>EnumRef.смартСтатусыЗаявокНаМаркетинговоеМероприятие</types>
    </type>
  </attributes>
  <attributes>
    <name>смартКомментарийКОценке</name>
    <comment>//++ #Б-6882 смарт: Фролов 25.05.2026 //Оценка демонстрации. Изменить поля и видимость</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартПровелДемонстрацию</name>
    <comment>//++ #Б-7258 смарт: Фролов 29.06.2026 //CRM. Конверсия демонстраций</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>смартИнтерес</name>
    <comment>//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ &quot;Маркетинговое мероприятие&quot;. Связь к Интересу &quot;один ко многим&quot;.</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </attributes>
  <tabularSections>
    <name>табОборудованиеДляДемонстрации</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.демоОборудованиеДляДемонстрации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>табМатериалыДляДемонстрации</name>
    <attributes>
      <name>Материалы</name>
      <type>
        <types>CatalogRef.демоМатериалыДемонстрации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>табПредставительКлиента</name>
    <attributes>
      <name>КонтактныеЛица</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>#Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияИзмененияОценки</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсполнителиДемоЗал</name>
    <comment>// #026 181 01.03.2020</comment>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗатраченноеВремя</name>
      <comment>// #026 181 01.03.2020</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СверхурочноеВремя</name>
      <comment>// #026 181 01.03.2020</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>смартКомментарийИнженера</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыРабот</name>
    <comment>// #026 181 01.03.2020</comment>
    <attributes>
      <name>ВидРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>смартЗатраченноеВремя</name>
      <comment>// 677 14.10.2021</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>смартСверхурочноеВремя</name>
      <comment>// 677 14.10.2021</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>смартИсполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеДляДемонстрацииИнженер</name>
    <comment>// #026 181 01.03.2020</comment>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.демоОборудованиеДляДемонстрации</types>
      </type>
    </attributes>
    <attributes>
      <name>смартИсполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/смартОбучениеСотрудников/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	Если Параметры.Ключ.Пустая() Тогда
		Объект.Ответственный = Пользователи.АвторизованныйПользователь();
		Объект.Состояние	 = Перечисления.смартСостоянияДокументовОбученияСотрудников.Черновик; 
		Объект.Партнер		 = Справочники.Партнеры.НайтиПоКоду("00-00007216");
		
		ПриЧтенииСозданииНаСервере();
	//Иначе
	//	Реквизиты 					= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПрограммаОбучения, "ПродолжительностьОбучения, ОценкаОбучения");
	//	ПродолжительностьОбучения 	= Реквизиты.ПродолжительностьОбучения;	
	//	ОценкаОбучения 				= Реквизиты.ОценкаОбучения;
	КонецЕсли; 
	ПредыдущееСостояние = Объект.Состояние;
	
	ОбновитьТелефоныКонтактныхЛиц();
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДокументБронирования = ПолучитьДокументБронирования(Объект.Ссылка);
	ПриЧтенииСозданииНаСервере();

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
			
	СобытияФормКлиент.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И 
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияДокументовОбученияСотрудников.Черновик") Тогда
		
		Отказ = Истина;
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
		
		ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи,,Истина);
		
		Возврат;
		
	ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись И 
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияДокументовОбученияСотрудников.Планирование") Тогда
		
		Отказ = Истина;
		
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюПоказатьВопросПровестиЗавершение", ЭтотОбъект, ДополнительныеПараметры),
					НСтр("ru='Состояние ""Планирование"" возможно только у проведенного документа. Провести документ?'"),
					РежимДиалогаВопрос.ДаНет,
					,
					КодВозвратаДиалога.Да);
		Возврат;
		
	ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи,,Истина);
		
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПоказатьВопросПровестиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТаблицаПоказателейВРезультатыОбучения(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ПриЧтенииСозданииНаСервере(); 
	ОбновитьТелефоныКонтактныхЛиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПринудительноЗакрытьФорму = Истина;
	
	Если (Объект.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияДокументовОбученияСотрудников.Черновик")
		ИЛИ Объект.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияДокументовОбученияСотрудников.Планирование"))
		И ЗначениеЗаполнено(ДокументБронирования) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Есть документ бронирования! Проведите документ с состоянием ""Оборудование зарезервировано""",,,, Отказ);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОтраженияПриИзменении(Элемент)
    УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.смартСостоянияДокументовОбученияСотрудников.ОборудованиеЗарезервировано") 
		И НЕ ЗначениеЗаполнено(ДокументБронирования) Тогда
		Объект.Состояние = ПредыдущееСостояние;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед переходом на это состояние, необходимо создать документ бронирования!", , , "ФорматированнаяСтрокаДокументБронирования");
	КонецЕсли;
	
	УстановитьДоступностьЭлементов(); 
	ПредыдущееСостояние = Объект.Состояние;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаОбученияПриИзменении(Элемент)
	ПрограммаОбученияПриИзмененииНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.ГруппаТаблицаПоказателей И ТребуетсяОбновитьТаблицуПоказателей Тогда
		КвалификацииСотрудникиПриИзменении();
		ТребуетсяОбновитьТаблицуПоказателей = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ФорматированнаяСтрокаДокументБронированияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если НавигационнаяСсылкаФорматированнойСтроки = "СоздатьДокументБронирования" Тогда 
		СтандартнаяОбработка = Ложь;
		Если Объект.БронируемоеОборудование.Количество() = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено бронируемое оборудование", , , "БронируемоеОборудование");
		Иначе
			Если НЕ Модифицированность Тогда
				ОткрытьМаркетинговыеМероприятияДокумент();
			Иначе
				ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаЗаписиДокумента", ЭтаФорма), 
							"Данные документа изменены. Перед созданием документа бронирования необходимо записать документ. Записать?", РежимДиалогаВопрос.ДаНет);			
			КонецЕсли;				
		КонецЕсли;
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "УдалитьДокументБронирования" Тогда 
		СтандартнаяОбработка = Ложь; 
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаУдаленияДокументаБронирования", ЭтаФорма), 
							"Документ бронирования будет помечен на удаление, продолжить?", РежимДиалогаВопрос.ДаНет);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент) 
	
	Если Объект.ДатаНачала = НачалоДня(Объект.ДатаНачала) Тогда
		Объект.ДатаНачала = Объект.ДатаНачала + 32400;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(ПродолжительностьОбучения) Тогда 
		Объект.ДатаОкончания = ПолучитьДатуПоКалендарю(Объект.ДатаНачала, ПродолжительностьОбучения - 1) + 64800;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоПроведенияПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКвалификации

&НаКлиенте
Процедура КвалификацииПриИзменении(Элемент)
	ТребуетсяОбновитьТаблицуПоказателей = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	ТребуетсяОбновитьТаблицуПоказателей = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредставителиКлиента

&НаКлиенте
Процедура ПредставителиКлиентаКонтактноеЛицоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПредставителиКлиента.ТекущиеДанные; 
	ТекущиеДанные.Телефон = ПолучитьТелефонКонтактногоЛица(ТекущиеДанные.КонтактноеЛицо);
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры 

#КонецОбласти

/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Реквизиты 					= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПрограммаОбучения, "ПродолжительностьОбучения, ОценкаОбучения");
	ПродолжительностьОбучения 	= Реквизиты.ПродолжительностьОбучения;	
	ОценкаОбучения 				= Реквизиты.ОценкаОбучения;

	УстановитьДоступностьЭлементов();
	РезультатыОбученияВТаблицуПоказателей();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	Элементы.Состояние.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокСостоянийПоВиду(Объект.ВидОтражения, Объект.МестоПроведения)); 
	
	ЭтоЧерновик 					= Объект.Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.Черновик;
	ЭтоПланирование 				= Объект.Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.Планирование;
	ЭтоОборудованиеЗарезервировано 	= Объект.Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.ОборудованиеЗарезервировано;
	ЭтоПроходящиеОбучениеУказаны 	= Объект.Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.ПроходящиеОбучениеУказаны;
	ЭтоОтражениеРезультатов 		= Объект.Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.ОтражениеРезультатов;
	ЭтоРезультатыОтражены 			= Объект.Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.РезультатыОтражены;
		
	ДоступностьРеквизитовПрограммы = ЭтоЧерновик
								 ИЛИ ЭтоПланирование
								 ИЛИ ЭтоОборудованиеЗарезервировано
								 ИЛИ ЭтоПроходящиеОбучениеУказаны;
	
	Элементы.ГруппаПрограмма.ТолькоПросмотр = НЕ ДоступностьРеквизитовПрограммы;
	Элементы.ГруппаПрограмма.Видимость      = Объект.ВидОтражения = 0;   
	
	Если Объект.ВидОтражения = 1 Тогда
		
		Элементы.ГруппаБронируемоеОборудование.Видимость = Ложь;
		Элементы.ГруппаПрисваемыеКвалификации.Видимость = Истина;
		Элементы.ГруппаПреподаватели.Видимость = Ложь;
		Элементы.ГруппаСотрудники.Видимость = Истина;
				
	Иначе
		
		//Элементы.ГруппаБронируемоеОборудование.Видимость = Истина;
		//Элементы.ГруппаПрисваемыеКвалификации.Видимость = Истина;
		//Элементы.ГруппаПреподаватели.Видимость = Истина;
		//Элементы.ГруппаСотрудники.Видимость = Истина;
		
		Если ЗначениеЗаполнено(ДокументБронирования) Тогда 		
			ЧастиСтроки = Новый Массив;
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Документ бронирования:'"), Новый Шрифт(,,,,Ложь)));
			ЧастиСтроки.Добавить(" ");
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Строка(ДокументБронирования), Новый Шрифт(,,,,Истина), ЦветаСтиля.ГиперссылкаЦвет,, ПолучитьНавигационнуюСсылку(ДокументБронирования)));
			
			Если ЭтоЧерновик ИЛИ ЭтоПланирование Тогда
				ЧастиСтроки.Добавить(" ");
				ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока("X", Новый Шрифт(,,Истина,,Ложь), WEBЦвета.Красный,, "УдалитьДокументБронирования"));
			КонецЕсли;
			ФорматированнаяСтрокаДокументБронирования = Новый ФорматированнаяСтрока(ЧастиСтроки);			
		Иначе 	
		    ФорматированнаяСтрокаДокументБронирования = Новый ФорматированнаяСтрока(НСтр("ru = '<Создать документ бронирования>'"), Новый Шрифт(,,,,Истина), ЦветаСтиля.ГиперссылкаЦвет,, "СоздатьДокументБронирования");
		КонецЕсли; 
		
		Элементы.ФорматированнаяСтрокаДокументБронирования.Доступность = НЕ ЭтоЧерновик;
		
		Элементы.ГруппаБронируемоеОборудование.Видимость 	= (ЭтоЧерновик ИЛИ ЭтоПланирование ИЛИ ЭтоОборудованиеЗарезервировано ИЛИ ЭтоПроходящиеОбучениеУказаны ИЛИ ЭтоОтражениеРезультатов)
															  И НЕ (ТипЗнч(Объект.МестоПроведения) = Тип("СправочникСсылка.CRM_Помещения"));
		Элементы.ГруппаПрисваемыеКвалификации.Видимость 	= ЭтоЧерновик ИЛИ ЭтоПланирование ИЛИ ЭтоОборудованиеЗарезервировано ИЛИ ЭтоПроходящиеОбучениеУказаны ИЛИ ЭтоОтражениеРезультатов;
			
		//Элементы.ГруппаПреподаватели.Видимость 	= ЭтоЧерновик ИЛИ ЭтоОборудованиеЗарезервировано ИЛИ ЭтоПроходящиеОбучениеУказаны ИЛИ ЭтоОтражениеРезультатов ИЛИ ЭтоРезультатыОтражены;
		//Элементы.ГруппаСотрудники.Видимость	 	= ЭтоЧерновик ИЛИ ЭтоОборудованиеЗарезервировано ИЛИ ЭтоПроходящиеОбучениеУказаны ИЛИ ЭтоОтражениеРезультатов ИЛИ ЭтоРезультатыОтражены;
		
		Элементы.ГруппаПреподаватели.Видимость 	= Истина;
		Элементы.ГруппаСотрудники.Видимость	 	= Истина; 
	КонецЕсли; 
	
	Элементы.ГруппаТаблицаПоказателей.Доступность = ЭтоОтражениеРезультатов ИЛИ ЭтоРезультатыОтражены;
	
	Если НЕ Пользователи.РолиДоступны("смартАдминистрированиеУчебногоЦентра") Тогда
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		ЭтоПреподаватель 	= Объект.Преподаватели.НайтиСтроки(Новый Структура("Преподаватель", ТекущийПользователь)).Количество() > 0; 
		
		Элементы.ГруппаШапка.ТолькоПросмотр = Истина;
		Элементы.ГруппаПрограмма.ТолькоПросмотр = Истина;
			
		Элементы.ГруппаБронируемоеОборудование.ТолькоПросмотр = Истина;
		Элементы.ГруппаПрисваемыеКвалификации.ТолькоПросмотр = Истина;
		Элементы.ГруппаПреподаватели.ТолькоПросмотр = Истина;
		Элементы.ГруппаСотрудники.ТолькоПросмотр = Истина;
		
		Элементы.ГруппаТаблицаПоказателей.ТолькоПросмотр 	= НЕ ЭтоПреподаватель;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Состояние = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Состояние");
		Если Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.РезультатыОтражены Тогда
			ЭтаФорма.ТолькоПросмотр 							= Истина;
			Элементы.ГруппаТаблицаПоказателей.ТолькоПросмотр 	= Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСостоянийПоВиду(ВидОтражения, МестоПроведения)
	Результат = Новый Массив;
	Если ВидОтражения = 0 Тогда
		Результат.Добавить(Перечисления.смартСостоянияДокументовОбученияСотрудников.Черновик);
		Результат.Добавить(Перечисления.смартСостоянияДокументовОбученияСотрудников.Планирование);
		Если НЕ ТипЗнч(МестоПроведения) = Тип("СправочникСсылка.CRM_Помещения") Тогда
			Результат.Добавить(Перечисления.смартСостоянияДокументовОбученияСотрудников.ОборудованиеЗарезервировано); 
		КонецЕсли;
		Результат.Добавить(Перечисления.смартСостоянияДокументовОбученияСотрудников.ПроходящиеОбучениеУказаны);
		Результат.Добавить(Перечисления.смартСостоянияДокументовОбученияСотрудников.ОтражениеРезультатов);
		Результат.Добавить(Перечисления.смартСостоянияДокументовОбученияСотрудников.РезультатыОтражены);
	Иначе
		Результат.Добавить(Перечисления.смартСостоянияДокументовОбученияСотрудников.Черновик);
		Результат.Добавить(Перечисления.смартСостоянияДокументовОбученияСотрудников.ОтражениеРезультатов);
		Результат.Добавить(Перечисления.смартСостоянияДокументовОбученияСотрудников.РезультатыОтражены);
	КонецЕсли;	
	Возврат Результат;
КонецФункции

#Область ТаблицаРезультатов

&НаСервере
Процедура КвалификацииСотрудникиПриИзменении()
	ТаблицаПоказателейВРезультатыОбучения(Объект);
    РезультатыОбученияВТаблицуПоказателей();
КонецПроцедуры

&НаСервере
Процедура РезультатыОбученияВТаблицуПоказателей() 
	ТаблицаКолонок = ПолучитьТаблицуКолонок(); 
	
	ТаблицаПоказателей.Очистить();
	УдалитьРеквизитыИЭлементыФормы("ТаблицаПоказателей");	
	СоздатьРеквизитыИЭлементыФормы("ТаблицаПоказателей", ТаблицаКолонок);
	
	Для Каждого СтрокаРезультата Из Объект.Квалификации Цикл		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		НоваяСтрока.Квалификация 			= СтрокаРезультата.Квалификация;
		НоваяСтрока.ЭтоОборудованиеКлиента 	= ТипЗнч(СтрокаРезультата.Квалификация) = Тип("СправочникСсылка.смартОборудованиеКлиентов");
		НоваяСтрока.ВариантОценки           = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРезультата.Квалификация, "ВариантОценки");
		Если Не ЗначениеЗаполнено(НоваяСтрока.ВариантОценки) И ЗначениеЗаполнено(ОценкаОбучения) Тогда 
			НоваяСтрока.ВариантОценки = ОценкаОбучения;
		ИначеЕсли Не ЗначениеЗаполнено(НоваяСтрока.ВариантОценки) Тогда
			НоваяСтрока.ВариантОценки = Перечисления.смартВариантыОценкиОбучения.ДесятибалльнаяШкала;   
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрокаРезультата Из Объект.РезультатыОбучения Цикл		
		УИНСотрудника = СтрЗаменить(Строка(СтрокаРезультата.Сотрудник.УникальныйИдентификатор()),"-","_");
		НайденныеСтроки = ТаблицаПоказателей.НайтиСтроки(Новый Структура("Квалификация", СтрокаРезультата.Квалификация));
		Если НайденныеСтроки.Количество() > 0 Тогда 
			СтрокаРезультатаПоКвалификации = НайденныеСтроки[0];
			СтрокаРезультатаПоКвалификации["Оцн_" + УИНСотрудника] = СтрокаРезультата.Оценка;
			СтрокаРезультатаПоКвалификации["Зач_" + УИНСотрудника] = СтрокаРезультата.Зачет;
			СтрокаРезультатаПоКвалификации["ЗРР_" + УИНСотрудника] = СтрокаРезультата.ЗРР;
			СтрокаРезультатаПоКвалификации["ПНР_" + УИНСотрудника] = СтрокаРезультата.ПНР;
		КонецЕсли; 	
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура ТаблицаПоказателейВРезультатыОбучения(ТекущийОбъект)
	ТекущийОбъект.РезультатыОбучения.Очистить();
	ТаблицаЗначенийПоказателей = РеквизитФормыВЗначение("ТаблицаПоказателей", Тип("ТаблицаЗначений"));
	Для Каждого СтрокаТаблицыПоказателей Из ТаблицаЗначенийПоказателей Цикл		
		Квалификация = СтрокаТаблицыПоказателей.Квалификация;
		Для Каждого Колонка Из ТаблицаЗначенийПоказателей.Колонки Цикл		
			Если Колонка.Имя = "Квалификация" ИЛИ Колонка.Имя = "ЭтоОборудованиеКлиента" ИЛИ Колонка.Имя = "ВариантОценки" ИЛИ Колонка.Имя = "ПравыйОтступ" Тогда
				Продолжить;
			КонецЕсли;			
			УИНСотрудника = Новый УникальныйИдентификатор(СтрЗаменить(Сред(Колонка.Имя, 5),"_","-"));			
			Если НЕ ТипЗнч(УИНСотрудника) = Тип("УникальныйИдентификатор") Тогда
				Продолжить;
			КонецЕсли;
			Сотрудник = Справочники.Пользователи.ПолучитьСсылку(УИНСотрудника);			
			НайденныеСтроки = ТекущийОбъект.РезультатыОбучения.НайтиСтроки(Новый Структура("Квалификация, Сотрудник", Квалификация, Сотрудник));
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаРезультат = НайденныеСтроки[0];
			Иначе
				СтрокаРезультат = ТекущийОбъект.РезультатыОбучения.Добавить();
				СтрокаРезультат.Квалификация  = Квалификация;
				СтрокаРезультат.Сотрудник = Сотрудник;
			КонецЕсли;
			Если Лев(Колонка.Имя, 4) = "Оцн_" Тогда
				СтрокаРезультат.Оценка = СтрокаТаблицыПоказателей[Колонка.Имя];
			ИначеЕсли Лев(Колонка.Имя, 4) = "Зач_" Тогда
				СтрокаРезультат.Зачет = СтрокаТаблицыПоказателей[Колонка.Имя];
			ИначеЕсли Лев(Колонка.Имя, 4) = "ЗРР_" Тогда
				СтрокаРезультат.ЗРР = СтрокаТаблицыПоказателей[Колонка.Имя];
			ИначеЕсли Лев(Колонка.Имя, 4) = "ПНР_" Тогда
				СтрокаРезультат.ПНР = СтрокаТаблицыПоказателей[Колонка.Имя];
			КонецЕсли;   		
		КонецЦикла;		
	КонецЦикла;
КонецПроцедуры   

&НаСервере
Функция ПолучитьТаблицуКолонок()
	ТаблицаКолонок = Новый ТаблицаЗначений;
	ТаблицаКолонок.Колонки.Добавить("Позиция");
	ТаблицаКолонок.Колонки.Добавить("ИмяКолонки");
	ТаблицаКолонок.Колонки.Добавить("ПредставлениеКолонки");
	ТаблицаКолонок.Колонки.Добавить("ТипКолонки"); 
	ТаблицаКолонок.Колонки.Добавить("ЦветФона");
	ТаблицаКолонок.Колонки.Добавить("Ширина");
	ТаблицаКолонок.Колонки.Добавить("Группировка");
	ТаблицаКолонок.Колонки.Добавить("Видимость", Новый ОписаниеТипов("Булево"));
	ТаблицаКолонок.Колонки.Добавить("ОтображатьВШапке", Новый ОписаниеТипов("Булево"));
	ТаблицаКолонок.Колонки.Добавить("ТолькоПросмотр", Новый ОписаниеТипов("Булево"));
	ТаблицаКолонок.Колонки.Добавить("ПредставлениеГруппировки");
	
	ЕстьКвалификацииПоОборудованию = Ложь;
	Для Каждого СтрокаКвалификации Из Объект.Квалификации Цикл		
		Если ТипЗнч(СтрокаКвалификации.Квалификация) = Тип("СправочникСсылка.смартОборудованиеКлиентов") Тогда	
			ЕстьКвалификацииПоОборудованию = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
    
	Для Каждого СтрокаСотрудник Из Объект.Сотрудники Цикл 
		Если НЕ ЗначениеЗаполнено(СтрокаСотрудник.Сотрудник) Тогда
			Продолжить;		
		КонецЕсли;

		Если НЕ ТаблицаКолонок.Найти(Строка(СтрокаСотрудник.Сотрудник), "ПредставлениеГруппировки") = Неопределено Тогда
			Продолжить;		
		КонецЕсли;
				
		УИНСотрудника 			= СтрЗаменить(Строка(СтрокаСотрудник.Сотрудник.УникальныйИдентификатор()),"-","_");
		ГруппировкаНовойСтроки 	= "Группировка_" + УИНСотрудника;
		
			
		НоваяСтрока = ТаблицаКолонок.Добавить();
		НоваяСтрока.Позиция 					= 0;
		НоваяСтрока.ИмяКолонки 					= "Оцн_" + УИНСотрудника;
		НоваяСтрока.ПредставлениеКолонки 		= "Оценка";
		НоваяСтрока.ТипКолонки 					= Новый ОписаниеТипов("Число");
		НоваяСтрока.Группировка             	= ГруппировкаНовойСтроки;
		НоваяСтрока.ПредставлениеГруппировки	= Строка(СтрокаСотрудник.Сотрудник);
		НоваяСтрока.ЦветФона                    = WebЦвета.Роса;
		НоваяСтрока.Ширина                      = 3;
		НоваяСтрока.Видимость                   = Истина;
		НоваяСтрока.ОтображатьВШапке            = Истина;
		
		НоваяСтрока = ТаблицаКолонок.Добавить();
		НоваяСтрока.Позиция 					= 0;
		НоваяСтрока.ИмяКолонки 					= "Зач_" + УИНСотрудника;
		НоваяСтрока.ПредставлениеКолонки 		= "Зачет";
		НоваяСтрока.ТипКолонки 					= Новый ОписаниеТипов("Булево");
		НоваяСтрока.Группировка             	= ГруппировкаНовойСтроки;
		НоваяСтрока.ПредставлениеГруппировки	= Строка(СтрокаСотрудник.Сотрудник);
		НоваяСтрока.ЦветФона                    = WebЦвета.Роса;
		НоваяСтрока.Ширина                      = 10;
		НоваяСтрока.Видимость                   = Истина;
		НоваяСтрока.ОтображатьВШапке            = Истина;
		
		НоваяСтрока = ТаблицаКолонок.Добавить();
		НоваяСтрока.Позиция 					= 1;
		НоваяСтрока.ИмяКолонки 					= "ЗРР_" + УИНСотрудника;
		НоваяСтрока.ПредставлениеКолонки 		= "ЗРР";
		НоваяСтрока.ТипКолонки 					= Новый ОписаниеТипов("Булево");
		НоваяСтрока.Группировка             	= ГруппировкаНовойСтроки;
		НоваяСтрока.ПредставлениеГруппировки	= Строка(СтрокаСотрудник.Сотрудник);
		НоваяСтрока.ЦветФона                    = Новый Цвет;
		НоваяСтрока.Ширина                      = 10;
		НоваяСтрока.Видимость                   = ЕстьКвалификацииПоОборудованию;
		НоваяСтрока.ОтображатьВШапке            = Истина;
		
		НоваяСтрока = ТаблицаКолонок.Добавить();
		НоваяСтрока.Позиция 					= 2;
		НоваяСтрока.ИмяКолонки 					= "ПНР_" + УИНСотрудника;
		НоваяСтрока.ПредставлениеКолонки 		= "ПНР";
		НоваяСтрока.ТипКолонки 					= Новый ОписаниеТипов("Булево");
		НоваяСтрока.Группировка             	= ГруппировкаНовойСтроки;
		НоваяСтрока.ПредставлениеГруппировки	= Строка(СтрокаСотрудник.Сотрудник);
		НоваяСтрока.ЦветФона                    = Новый Цвет;
		НоваяСтрока.Ширина                      = 10;
		НоваяСтрока.Видимость                   = ЕстьКвалификацииПоОборудованию;
		НоваяСтрока.ОтображатьВШапке            = Истина;
		
   	КонецЦикла;
	
	НоваяСтрока = ТаблицаКолонок.Добавить();
	НоваяСтрока.Позиция 					= 3;
	НоваяСтрока.ИмяКолонки 					= "ПравыйОтступ";
	НоваяСтрока.ПредставлениеКолонки 		= "Отступ";
	НоваяСтрока.ТипКолонки 					= Новый ОписаниеТипов("Строка");
	НоваяСтрока.Группировка             	= "";
	НоваяСтрока.ПредставлениеГруппировки	= "";
	НоваяСтрока.ЦветФона                    = Новый Цвет;
	НоваяСтрока.Ширина                      = 10;
	НоваяСтрока.Видимость                   = Истина;
	НоваяСтрока.ОтображатьВШапке            = Ложь;
	НоваяСтрока.ТолькоПросмотр	            = Истина;

	Возврат ТаблицаКолонок;
КонецФункции

#Область Интерфейс

&НаСервере
Процедура УдалитьРеквизитыИЭлементыФормы(ИмяТаблицы)
	МассивУдаляемыхРеквизитов = Новый Массив;
	МассивУдаляемыхЭлементов = Новый Массив;
	
	НайденныйЭлементФормы = Элементы.Найти(ИмяТаблицы);
	Если НЕ НайденныйЭлементФормы = Неопределено Тогда
		Для Каждого УдаляемыйЭлемент Из НайденныйЭлементФормы.ПодчиненныеЭлементы Цикл
			Если УдаляемыйЭлемент.Имя = ИмяТаблицы + "Квалификация" Тогда
				Продолжить;		
			КонецЕсли;
			
			Если ТипЗнч(УдаляемыйЭлемент) = Тип("ГруппаФормы") Тогда
				Для Каждого УдаляемыйЭлементВГруппе Из УдаляемыйЭлемент.ПодчиненныеЭлементы Цикл
					Если ТипЗнч(УдаляемыйЭлементВГруппе) = Тип("ГруппаФормы") Тогда
						Для Каждого УдаляемыйЭлементВГруппе2 Из УдаляемыйЭлементВГруппе.ПодчиненныеЭлементы Цикл
							МассивУдаляемыхРеквизитов.Добавить(УдаляемыйЭлементВГруппе2.ПутьКДанным);
						КонецЦикла;
					Иначе
						МассивУдаляемыхРеквизитов.Добавить(УдаляемыйЭлементВГруппе.ПутьКДанным);
					КонецЕсли;                                                                  				
				КонецЦикла;
			Иначе
				МассивУдаляемыхРеквизитов.Добавить(УдаляемыйЭлемент.ПутьКДанным);
			КонецЕсли;
			
			МассивУдаляемыхЭлементов.Добавить(УдаляемыйЭлемент);
		КонецЦикла;	
	КонецЕсли;
	Для Каждого ЭлементДляУдаления Из МассивУдаляемыхЭлементов Цикл
		Элементы.Удалить(ЭлементДляУдаления);
	КонецЦикла;
	ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
КонецПроцедуры 

&НаСервере
Процедура СоздатьРеквизитыИЭлементыФормы(ИмяТаблицы, ТаблицаКолонок)
	СоздатьРеквизитыФормы(ИмяТаблицы, ТаблицаКолонок);
	СоздатьЭлементыФормы(ИмяТаблицы, ТаблицаКолонок);
	УстановитьУсловноеОформлениеТаблицы(ИмяТаблицы);
КонецПроцедуры 

&НаСервере
Процедура СоздатьРеквизитыФормы(ИмяТаблицы, ТаблицаКолонок)  
	МассивДобавляемыхРеквизитов = Новый Массив;
		
	Для Каждого Колонка Из ТаблицаКолонок Цикл
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Колонка.ИмяКолонки, Колонка.ТипКолонки, ИмяТаблицы, Колонка.ПредставлениеКолонки, Ложь));
	КонецЦикла; 

	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
КонецПроцедуры  

&НаСервере
Процедура СоздатьЭлементыФормы(ИмяТаблицы, ТаблицаКолонок)
	ГруппаКолонок = Неопределено;
	Для Каждого Колонка Из ТаблицаКолонок Цикл   
		Если НЕ ГруппаКолонок = Колонка.Группировка И ЗначениеЗаполнено(Колонка.Группировка) Тогда  
			ГруппаКолонок 										= Колонка.Группировка;
			НоваяГруппаКолонок									= Элементы.Добавить(ИмяТаблицы + Колонка.Группировка, Тип("ГруппаФормы"), Элементы[ИмяТаблицы]);
			НоваяГруппаКолонок.Заголовок 						= Колонка.ПредставлениеГруппировки;
			НоваяГруппаКолонок.ОтображатьВШапке 				= Истина;
			НоваяГруппаКолонок.Группировка 						= ГруппировкаКолонок.Горизонтальная; 
			НоваяГруппаКолонок.ГоризонтальноеПоложениеВШапке 	= ГоризонтальноеПоложениеЭлемента.Центр;
			
			//НоваяГруппаКолонок									= Элементы.Добавить(ИмяТаблицы + Колонка.Группировка + "_Оценка", Тип("ГруппаФормы"), Элементы[ИмяТаблицы + Колонка.Группировка]);
			//НоваяГруппаКолонок.Заголовок 						= Колонка.ПредставлениеГруппировки;
			//НоваяГруппаКолонок.ОтображатьВШапке 				= Ложь;
			//НоваяГруппаКолонок.Группировка 						= ГруппировкаКолонок.Горизонтальная; 
			//НоваяГруппаКолонок.ГоризонтальноеПоложениеВШапке 	= ГоризонтальноеПоложениеЭлемента.Центр;
			//НоваяГруппаКолонок.Ширина                           = Колонка.Ширина;
		КонецЕсли;   
		
		//Если Колонка.Позиция = 0 Тогда
		//	НоваяКолонка	= Элементы.Добавить(ИмяТаблицы + Колонка.ИмяКолонки, Тип("ПолеФормы"), Элементы[ИмяТаблицы + Колонка.Группировка + "_Оценка"]);
		//ИначеЕсли Колонка.Позиция = 3 Тогда
		//	НоваяКолонка	= Элементы.Добавить(ИмяТаблицы + Колонка.ИмяКолонки, Тип("ПолеФормы"), Элементы[ИмяТаблицы]);
		//Иначе
		//	НоваяКолонка	= Элементы.Добавить(ИмяТаблицы + Колонка.ИмяКолонки, Тип("ПолеФормы"), Элементы[ИмяТаблицы + Колонка.Группировка]);
		//КонецЕсли;  
		
		Если Колонка.Позиция = 3 Тогда
			НоваяКолонка	= Элементы.Добавить(ИмяТаблицы + Колонка.ИмяКолонки, Тип("ПолеФормы"), Элементы[ИмяТаблицы]);
		Иначе
			НоваяКолонка	= Элементы.Добавить(ИмяТаблицы + Колонка.ИмяКолонки, Тип("ПолеФормы"), Элементы[ИмяТаблицы + Колонка.Группировка]);
		КонецЕсли; 
		
		НоваяКолонка.Ширина 						= Колонка.Ширина;
		НоваяКолонка.Вид 							= ?(Колонка.ТипКолонки = Новый ОписаниеТипов("Булево"), ВидПоляФормы.ПолеФлажка, ВидПоляФормы.ПолеВвода);
		НоваяКолонка.ПутьКДанным 					= ИмяТаблицы + "." + Колонка.ИмяКолонки;
		НоваяКолонка.Заголовок      				= Колонка.ПредставлениеКолонки;
		НоваяКолонка.ГоризонтальноеПоложениеВШапке 	= ГоризонтальноеПоложениеЭлемента.Лево;
		НоваяКолонка.ГоризонтальноеПоложение 		= ГоризонтальноеПоложениеЭлемента.Лево;
		НоваяКолонка.Видимость				 		= Колонка.Видимость; 
		НоваяКолонка.ЦветФона 						= Колонка.ЦветФона;
		НоваяКолонка.ОтображатьВШапке               = Колонка.ОтображатьВШапке;
		НоваяКолонка.ТолькоПросмотр             	= Колонка.ТолькоПросмотр;
		
		Если Колонка.ТипКолонки = Новый ОписаниеТипов("Число") Тогда 
			НоваяКолонка.ГоризонтальноеПоложениеВШапке 	= ГоризонтальноеПоложениеЭлемента.Центр;
			НоваяКолонка.ГоризонтальноеПоложение 		= ГоризонтальноеПоложениеЭлемента.Центр;
			НоваяКолонка.МинимальноеЗначение        	= 0;
			НоваяКолонка.МаксимальноеЗначение       	= 10;
		КонецЕсли;			
	КонецЦикла;  
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеТаблицы(ИмяТаблицы)

	УсловноеОформление.Элементы.Очистить();
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	Для Каждого СтрокаСотрудник Из Объект.Сотрудники Цикл 
		Если НЕ ЗначениеЗаполнено(СтрокаСотрудник.Сотрудник) Тогда
			Продолжить;		
		КонецЕсли;

		УИНСотрудника	= СтрЗаменить(Строка(СтрокаСотрудник.Сотрудник.УникальныйИдентификатор()),"-","_");
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяТаблицы + "ЗРР_" + УИНСотрудника].Имя);
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяТаблицы + "ПНР_" + УИНСотрудника].Имя);

	КонецЦикла;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".ЭтоОборудованиеКлиента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	Для Каждого СтрокаСотрудник Из Объект.Сотрудники Цикл 
		Если НЕ ЗначениеЗаполнено(СтрокаСотрудник.Сотрудник) Тогда
			Продолжить;		
		КонецЕсли;

		УИНСотрудника	= СтрЗаменить(Строка(СтрокаСотрудник.Сотрудник.УникальныйИдентификатор()),"-","_");
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяТаблицы + "Оцн_" + УИНСотрудника].Имя);
		
	КонецЦикла;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".ВариантОценки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.смартВариантыОценкиОбучения.ЗачетНезачет;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь); 
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	Для Каждого СтрокаСотрудник Из Объект.Сотрудники Цикл 
		Если НЕ ЗначениеЗаполнено(СтрокаСотрудник.Сотрудник) Тогда
			Продолжить;		
		КонецЕсли;

		УИНСотрудника	= СтрЗаменить(Строка(СтрокаСотрудник.Сотрудник.УникальныйИдентификатор()),"-","_");
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ИмяТаблицы + "Зач_" + УИНСотрудника].Имя);
		
	КонецЦикла;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".ВариантОценки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.смартВариантыОценкиОбучения.ЗачетНезачет;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);


КонецПроцедуры

#КонецОбласти   

&НаСервере
Процедура ПрограммаОбученияПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ПрограммаОбучения) Тогда
		Возврат;	
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПрограммаОбучения, "НаименованиеПолное, ВидОбучения, МестоПроведения, ПродолжительностьОбучения, ОценкаОбучения, Преподаватели, ОборудованиеДИЦ, Квалификации");
	
	Если НЕ ЗначениеЗаполнено(Объект.ОписаниеПрограммы) Тогда
		Объект.ОписаниеПрограммы = Реквизиты.НаименованиеПолное;	
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(Объект.ВидОбучения) Тогда
		Объект.ВидОбучения = Реквизиты.ВидОбучения;	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.МестоПроведения) Тогда
		Объект.МестоПроведения = Реквизиты.МестоПроведения;	
	КонецЕсли;  
	
	ПродолжительностьОбучения = Реквизиты.ПродолжительностьОбучения;	
		
	ОценкаОбучения = Реквизиты.ОценкаОбучения;	
	
	Если Объект.Преподаватели.Количество() = 0 Тогда
		Объект.Преподаватели.Загрузить(Реквизиты.Преподаватели.Выгрузить());	
	КонецЕсли; 
	
	Если Объект.БронируемоеОборудование.Количество() = 0 Тогда
		Объект.БронируемоеОборудование.Загрузить(Реквизиты.ОборудованиеДИЦ.Выгрузить());	
	КонецЕсли;

	Если Объект.Квалификации.Количество() = 0 Тогда
		Объект.Квалификации.Загрузить(Реквизиты.Квалификации.Выгрузить());	
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьДокументБронирования(Ссылка) 
	Возврат Документы.смартОбучениеСотрудников.ПолучитьДокументБронирования(Ссылка);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуПоКалендарю(ДатаНачала, Длительность) 
	Календарь = Константы.ОсновнойКалендарьПредприятия.Получить();
	Возврат CRM_КалендарныеГрафики.ПолучитьДатуПоКалендарю(Календарь, ДатаНачала, Длительность, Ложь, Истина);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТелефонКонтактногоЛица(КонтактноеЛицо)	
	Результат = "";
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(КонтактноеЛицо);

	МассивВидов = Новый Массив;
	МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица);
	МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
	 
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);

	КонтактнаяИнформацияТелефоны = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
									   МассивСсылок, МассивТипов, МассивВидов, ТекущаяДата());
							   
	Для Каждого СтрТелефон Из КонтактнаяИнформацияТелефоны Цикл
		
		Если ЗначениеЗаполнено(СтрТелефон.Представление) Тогда
			Возврат СтрТелефон.Представление;
		КонецЕсли;
		
	КонецЦикла;							   
		
	Возврат Результат;		
КонецФункции

&НаСервере
Процедура ОбновитьТелефоныКонтактныхЛиц() 
	Для Каждого СтрокаПредставителей Из Объект.ПредставителиКлиента Цикл 	
		СтрокаПредставителей.Телефон = ПолучитьТелефонКонтактногоЛица(СтрокаПредставителей.КонтактноеЛицо); 	
	КонецЦикла;  
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПослеСозданияМаркетинговогоМероприятия(Результат, Дополнительныепараметры) Экспорт
	ДокументБронирования = ПолучитьДокументБронирования(Объект.Ссылка);
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьМаркетинговыеМероприятияДокумент()
	ОткрытьФорму("Документ.МаркетинговыеМероприятияДокумент.ФормаОбъекта", Новый Структура("Основание", Объект.Ссылка), ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,
							Новый ОписаниеОповещения("ПослеСозданияМаркетинговогоМероприятия", ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаЗаписиДокумента(Результат, Дополнительныепараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Записать() Тогда
			ОткрытьФорму("Документ.МаркетинговыеМероприятияДокумент.ФормаОбъекта", Новый Структура("Основание", Объект.Ссылка), ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,
							Новый ОписаниеОповещения("ПослеСозданияМаркетинговогоМероприятия", ЭтаФорма));  
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВопросаУдаленияДокументаБронирования(Результат, Дополнительныепараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если УдалитьДокументБронированияНаСервере(ДокументБронирования) Тогда
			ДокументБронирования = Неопределено;
			УстановитьДоступностьЭлементов();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция УдалитьДокументБронированияНаСервере(ДокументБронирования)
	Результат = Истина;
	Если НЕ ЗначениеЗаполнено(ДокументБронирования) Тогда
		Возврат Результат;	
	КонецЕсли;
	ДокументБронированияОбъект = ДокументБронирования.ПолучитьОбъект();
	ДокументБронированияОбъект.ПометкаУдаления = Истина;
	Попытка
		ДокументБронированияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Исключение 
		Результат = Ложь;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось пометить на удаление документ %1:%2", ДокументБронирования, ОписаниеОшибки()));
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

#КонецОбласти
